import  { Component } from 'react'
import { Table } from 'antd';
import { Link } from 'react-router-dom';


const columns = [
  {
    title: '角色',
    dataIndex: '角色',
    key: '角色',
    render: (text:any )=> <a>{text}</a>,
  },

  {
    title: '科室',
    dataIndex: '科室',
    key: '科室',
    render: (text:any )=> <a>{text}</a>,
  },
  
  {
    title: '详情',
    dataIndex: '详情',
    key: '详情',
  },

  {
    title: '操作',
    dataIndex: '操作',
    key: '操作',
    render:(text:any) => <Link to={`/fore/BasicTable?params=${text}`}>进入科室</Link>,
  },

 
  
];

const data = [
  {
    key: '1',
    角色:'医生',
    科室: "1.诊室",
    详情: '包括诊室的布局介绍；对宠物进行临床基本检查（视、听、触、嗅等）、疾病诊断；与宠物主人交流并根据情况开具处方。',
    操作:1,
    tags: ['nice', 'developer'],
    
  },
  {
    key: '2',
    角色:'助手，医生',
    科室: "2.免疫室",
    详情: '包括为健康宠物接种疫苗的流程，对常见并发症的处理流程，对常见免疫相关问题的解答等。',
    操作:12,
    tags: ['loser'],
    
  
  },
  {
    key: '3',
    角色:'助手，医生',
    科室: "3.化验室",
    详情: '包括对送检样本的预处理，对相应样本进行血常规、血液生化、电解质、血气、血凝指标、激素指标、尿常规、微生物学检查、药敏、皮肤刮片、粪便检查、传染病检查等检查操作流程。',
    操作:9,
    tags: ['cool', 'teacher'],
    
  },
  {
    key: '4',
    角色:'助手',
    科室: "4.影像室",
    详情: '包括X线检查、B超检查以及CT、MRI检查。如X线检查:X光机的结构功能介绍、全身各部位的摆位、拍摄条件的选择、拍摄流程、洗片的操作流程。B超检查：扫查探头的选择、全身各个部位扫查的摆位、腹部扫查流程。',
    操作:10,
    tags: ['cool', 'teacher'],
   
  },
  {
    key: '5',
    角色:'医生',
    科室: "5.检查室",
    详情: '包括对眼科、骨科、神经科、心脏科等专科疾病的检查，如眼科（检眼镜检查、眼压检查、裂隙灯检查、眼底检查、泪液分泌量检查等）、心脏科检查（心脏听诊、心电图检查等）、神经学检查（步态检查、各种反射检查等）等。',
    操作:4,
    tags: ['loser'],
    
  
  },
  {
    key: '6',
    角色:'助手，医生',
    科室: "6.处置室",
    详情: '包括口服投药、换药、清洗耳道、挤肛门腺、修剪指甲、鼻饲管放置、灌肠、安乐死等基本处置操作流程。',
    操作:11,
    tags: ['loser'],
    
  
  },
  {
    key: '7',
    角色:'助手，医生',
    科室: "7.药房",
    详情: '包括对各种药物的存放要求、处方的审核流程、药物的发放流程、常见药物的使用说明等。',
    操作:8,
    tags: ['loser'],
    
  
  },
  {
    key: '8',
    角色:'助手，医生',
    科室: "8.注射室",
    详情: '包括静脉注射、皮下注射、肌肉注射、局部封闭注射的操作流程，常见问题的处理方法，输液泵、加热垫的使用方法，注射室的消毒流程。',
    操作:7,
    tags: ['loser'],
    
  },
  {
    key: '9',
    操作:6,
    角色:'助手，医生',
    科室: "9.手术准备室",
    详情: '包括术前对宠物进行麻前给药、注射麻醉、吸入麻醉的流程，保定、剃毛、消毒的流程，常见手术器械的介绍，手术器械包的准备、灭菌流程，手术人员的消毒、穿戴手术衣流程等。',
    tags: ['loser'],
   
  
  },
  {
    key: '10',
    角色:'医生',
    科室: "10.手术室",
    详情: '包括手术室的布局介绍，手术室消毒流程，手术无菌要求，常规手术、特殊手等的操作规范。',
    操作:3,
    tags: ['loser'],
   
  
  },
  {
    key: '11',
    科室: "11.住院部",
    角色:'助手，医生',
    详情: '包括对需要住院的病例进行护理分级，不同护理级别的要求，住院部的工作流程，住院部的消毒流程等。',
    操作:5,
    tags: ['loser'],
    
  
  },
  {
    key: '1',
    角色:'前台',
    科室: "12.前台",
    详情: '包括接待挂号、导医咨询、病历档案发出与回收、收费等。',
    操作:0,
    tags: ['nice', 'developer'],
  },
  {
    key: '2',
    角色:'前台',
    科室: "13.档案室",
    详情: '包括病例档案的合理保存与数据统计等。',
    操作:2,
    tags: ['loser'],
    
   
  },
];
export default class Roleplay extends Component {
  render() {
    return (
        <Table columns={columns} dataSource={data} pagination={{defaultPageSize:9}}/>
    )
  }
}
